/* SPDX-License-Identifier: BSD-3-Clause
Copyright ©2024 Ryan Castellucci, some rights reserved.
gcc -Os -std=gnu17 -Wall -Wextra -pedantic proberelay_nopcap.c -o proberelay_nopcap #*/

// asprintf
#ifndef _GNU_SOURCE
#define _GNU_SOURCE
#endif

#include <string.h>
#include <stdbool.h>
#include <stdint.h>
#include <stdlib.h>
#include <stdarg.h>
#include <unistd.h>
#include <endian.h>
#include <errno.h>
#include <stdio.h>

#include <time.h>

#include <poll.h>

#include <grp.h>

#include <netdb.h>

#include <sys/socket.h>
#include <sys/ioctl.h>
#include <sys/types.h>
#include <sys/stat.h>
#include <sys/time.h>

#include <net/if.h>
#include <net/ethernet.h>

#include <arpa/inet.h>

#include <linux/filter.h>
#include <linux/net_tstamp.h>
#include <linux/if_packet.h>
#include <linux/if_ether.h>
#ifndef ARPHRD_IEEE80211_RADIOTAP
#include <linux/if_arp.h>
#endif

#ifndef NDEBUG
#include "debugp.h"
#else
#define debugp(...) do {} while (0)
#endif

#ifndef BUILD_TIME
#define BUILD_TIME __TIMESTAMP__
#endif
#ifndef VERSION
#define VERSION "0.0.1"
#endif
#ifndef VERSION_EXTRA
#define VERSION_EXTRA ""
#endif

#ifndef BPF_INST
#define _BPFJ(I, J) (J == 0 ? 0 : (J - (I + 1)))
#define BPF_INST(I, CODE, JT, JF, K) { CODE, _BPFJ(I, JT), _BPFJ(I, JF), K }
#endif

#define SIGNAL_NONE -128

#define RT_OFFSET_UNKNOWN -1
#define RT_OFFSET_NONE -2

#define TS_UNSET   0
#define TS_KERNEL  1
#define TS_SYSTEM  2
#define TS_COARSE  3
#define TS_NONE    4

#define MTU 1500

#define IP4_HDR_LEN 20
#define IP6_HDR_LEN 40
#define UDP_HDR_LEN  8

#define PCAP_MAGIC_MICRO 0xA1B2C3D4
#define PCAP_MAGIC_NANO  0xA1B23C4D

#ifdef PCAP_USE_MICRO
#define PCAP_MAGIC PCAP_MAGIC_MICRO
// convert nanoseconds to microseconds
#define TS_SCALE(X) ((X) / 1000)
#else
#define PCAP_MAGIC PCAP_MAGIC_NANO
#define TS_SCALE(X) (X)
#endif

#ifndef DLT_IEEE802_11
#define DLT_IEEE802_11       105 /* IEEE 802.11 wireless */
#endif
#ifndef DLT_IEEE802_11_RADIO
#define DLT_IEEE802_11_RADIO 127 /* 802.11 plus radiotap radio header */
#endif

#define MIN(A, B) ((A) < (B) ? (A) : (B))
#define MAX(A, B) ((A) > (B) ? (A) : (B))

#ifndef SO_TIMESTAMPING_OLD
#define SO_TIMESTAMPING_OLD 37
#endif
#ifndef SO_TIMESTAMPING_NEW
#define SO_TIMESTAMPING_NEW 65
#endif

static int so_tstamp = SO_TIMESTAMPING_NEW;

struct scm_timestamping {
  struct timespec ts[3];
};

/* 40 bytes - this is a pcap file header plus a packet record header */
struct header_s {
  /* PCAP FILE HEADER */
  /*  0 */ uint32_t  magic_number;
  /*  4 */ uint16_t  version_major;
  /*  6 */ uint16_t  version_minor;
  /*  8 */ int32_t   thiszone;
  /* 12 */ uint32_t  sigfigs;
  /* 16 */ uint32_t  snaplen;
  /* 20 */ uint32_t  linktype;
  /* PCAP PACKET RECORD */
  /* 24 */ uint32_t  ts_sec;
  /* 28 */ uint32_t  ts_fsec;
  /* 32 */ uint32_t  incl_len;
  /* 36 */ uint32_t  orig_len;
  /* PCAP PACKET DATA */
  /* 40 */ uint8_t   packet[];
};

// state object for packet handler callback
struct capture_s {
  struct addrinfo *ai;
  int cap_fd;
  int dst_fd;
  int linktype;
  int filter_state;
  int wlan_offset;
  int flags_offset;
  int signal_offset;
  int tstamp_mode;
  int min_signal;
  uint32_t snaplen;
  uint8_t exclude[1024];
};

static int arphdr_to_dlt(int arphdr) {
  int dlt;
  switch (arphdr) {
    case ARPHRD_IEEE80211_RADIOTAP:
      dlt = DLT_IEEE802_11_RADIO;
      break;
    case ARPHRD_IEEE80211:
      dlt = DLT_IEEE802_11;
      break;
    default:
      dlt = -1;
      break;
  }

  return dlt;
}

static int rt_flags_offset(const uint8_t *pkt) {
  int flags_offset = RT_OFFSET_NONE, p = 1;
  uint32_t *radiotap = (uint32_t *)pkt;
  uint32_t it_present = le32toh(radiotap[p]);

  // check whether bit 1 (flags) is set in the it_present bitmask
  if (it_present & (1<<1)) {
    // check whether bit 0 (tsft) is set in the it_present bitmask
    bool has_tsft = it_present & (1<<0);

